[
    {
        "name": "Mario",
        "description": "Recurring Character",
        "image": "https://mario.nintendo.com/static/86bd56fed456e9b642100519880b6a86/b3853/mario.png",
        "height": "155 cm",
        "weight": "75 kg",
        "eyeColor": "Blue",
        "mainAbility": "Jumping",
        "story": "Mario, the heroic plumber of the Mushroom Kingdom, is a name synonymous with bravery and determination. Donning his signature red cap and overalls, Mario embarked on his journey as a simple tradesman only to become the kingdom’s greatest hero. His first adventure began when he stepped up to rescue Princess Peach from Bowser, the fearsome King of the Koopas. Little did Mario know that this act of courage would mark the start of a lifetime of daring quests.Throughout his adventures, Mario has explored places beyond imagination. From lush green meadows to fiery volcanoes, haunted mansions, and even distant galaxies, there’s no terrain too challenging for him. With his unmatched jumping skills, quick reflexes, and the ability to harness power-ups like the Fire Flower and Super Star, Mario defeats enemies of all sizes. He’s crossed paths with countless foes, from mischievous Goombas to towering giants, yet his spirit remains unyielding.Despite his heroics, Mario never loses his cheerful demeanor. He is a beloved friend to many, including his loyal brother Luigi, the fearless Yoshi, and the kind Princess Peach. Though he is often called upon to save the kingdom, Mario cherishes quieter moments, whether racing go-karts with friends or enjoying a meal of his favorite food—spaghetti. Mario’s story is one of resilience, proving that even the humblest beginnings can lead to extraordinary adventures. For the Mushroom Kingdom, Mario is more than a hero; he’s a symbol of hope and unwavering optimism.",
        "strengthLevel": "High"
    },
    {
        "name": "Princess Peach",
        "description": "Head of State",
        "image": "https://upload.wikimedia.org/wikipedia/en/thumb/1/16/Princess_Peach_Stock_Art.png/170px-Princess_Peach_Stock_Art.png",
        "height": "165 cm",
        "weight": "60 kg",
        "eyeColor": "Blue",
        "mainAbility": "Diplomacy",
        "story": "Princess Peach Toadstool, the ruler of the Mushroom Kingdom, embodies grace, wisdom, and courage. From her throne in the grand castle, Peach oversees her kingdom with a kind yet firm hand, ensuring her subjects live in harmony. Despite her royal status, Peach is no stranger to peril. Bowser, the perennial antagonist, often kidnaps her in his bid to seize control of the kingdom. Yet, Peach’s resourcefulness ensures she is never merely a damsel in distress.Peach has an incredible ability to stay calm under pressure, leaving subtle clues to aid her rescue. Her signature parasol, far from being just an accessory, serves as a versatile tool—a weapon, a shield, and even a glider. When she’s not managing royal affairs or outsmarting Bowser, Peach participates in sports and races, where her competitive spirit shines. Whether swinging a tennis racket or speeding through a kart race, Peach demonstrates that she’s as dynamic as she is regal.Her compassion extends beyond her kingdom. Peach has often extended a hand of friendship to former foes, understanding the value of unity. Her story is a testament to the power of diplomacy and the quiet strength of a leader who puts her people above all. For the Mushroom Kingdom, Peach is more than a monarch—she is a beacon of resilience and hope.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Kamek",
        "description": "Maternal figure",
        "image": "https://e7.pngegg.com/pngimages/418/95/png-clipart-mario-kart-7-bowser-kamek-mario-bros-mario-kart-heroes-nintendo.png",
        "height": "150 cm",
        "weight": "50 kg",
        "eyeColor": "Yellow",
        "mainAbility": "Magic",
        "story": "Kamek, the loyal Magikoopa, has been a guiding figure for Bowser since the latter’s infancy. Acting as a caretaker, advisor, and powerful magician, Kamek’s role in the Mushroom Kingdom’s power struggles is both significant and multifaceted. His devotion to Bowser is unwavering, rooted in a belief that Bowser’s reign is destined. As Bowser grew into the formidable King of the Koopas, Kamek’s influence and magical prowess became integral to his plans.Known for his mastery of spells, Kamek can conjure illusions, teleport, and transform objects into menacing foes. His ability to manipulate his environment makes him a daunting opponent for Mario and his allies. From summoning dangerous enemies to creating complex puzzles, Kamek has tested Mario’s wits and strength countless times. Despite his adversarial role, Kamek’s motives are not rooted in malice but in loyalty. He views his actions as a means to protect Bowser and fulfill the Koopa King’s ambitions.Kamek’s interactions with others hint at a layered personality. While fiercely loyal to Bowser, he occasionally shows a dry wit and intellectual curiosity, making him a fascinating character. His story is one of ambition, devotion, and the complexities of loyalty. Kamek’s journey demonstrates that even those who serve in the shadows play vital roles in shaping the destiny of their kingdoms.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Birdo",
        "description": "Boss Character",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRwbQD8RBKOA_-OiGZ85nXmci2tKEHYXZ5V9qjmcKs6DoLZh1HhM74ap5iwUS0bluYzeRc&usqp=CAU",
        "height": "180 cm",
        "weight": "80 kg",
        "eyeColor": "Pink",
        "mainAbility": "Egg Shooting",
        "story": "Birdo, a vibrant and enigmatic character, stands out as one of the most unique figures in the Mushroom Kingdom. Recognized by her bright pink complexion, oversized bow, and confident demeanor, Birdo first appeared as an adversary. Armed with her remarkable ability to shoot eggs with precision, she posed a considerable challenge to Mario and his allies. However, over time, Birdo’s journey took an unexpected turn, evolving into that of a loyal ally and fan favorite.Birdo’s transformation from a boss character to a companion highlights her adaptability and depth. Her boldness is matched by her loyalty, as she’s frequently seen supporting Mario and his friends in sports tournaments, races, and other adventures. Whether competing fiercely or offering her unique skills to aid a mission, Birdo’s charisma and courage shine through.Beyond her competitive spirit, Birdo exudes individuality. She unapologetically embraces her quirks and encourages others to do the same. Her journey from a misunderstood character to a celebrated ally reflects the power of self-discovery and acceptance. For the Mushroom Kingdom, Birdo is more than an eccentric figure; she’s a reminder that growth and change can lead to unexpected friendships.",
        "strengthLevel": "High"
    },
    {
        "name": "Nabbit",
        "description": "Fleeing from the Road House",
        "image": "https://static.wikia.nocookie.net/mario/images/f/f7/SMBW_Nabbit.webp",
        "height": "140 cm",
        "weight": "40 kg",
        "eyeColor": "Green",
        "mainAbility": "Stealing",
        "story": "Nabbit is a character defined by his mischievous antics and remarkable speed. Known for his signature sack of stolen goods, Nabbit is perpetually on the run, evading those who seek to recover what he’s taken. His first appearance in New Super Mario Bros. U established him as a comedic yet challenging figure, often outpacing even the swiftest of heroes. Despite his troublemaking tendencies, Nabbit exudes a sense of playful charm that makes him more endearing than antagonistic.What sets Nabbit apart is his agility and wit. His ability to navigate complex terrains and outmaneuver pursuers speaks to his cunning nature. However, Nabbit’s actions are rarely malicious. His thieving escapades seem more driven by a love for adventure than a desire to harm others. This nuanced portrayal blurs the lines between hero and rogue.Occasionally, Nabbit has been known to team up with Mario and his friends, lending his skills to the greater good. These moments reveal a character who, while unpredictable, is not without a moral compass. Nabbit’s story is one of chaos and humor, showing that even the most mischievous characters can surprise you with their hidden depths.",
        "strengthLevel": "Low"
    },
    {
        "name": "Toadette",
        "description": "Member of the Toad species",
        "image": "https://i.pinimg.com/236x/dc/9d/22/dc9d227d421cae78d533b16bff95ef04.jpg",
        "height": "90 cm",
        "weight": "20 kg",
        "eyeColor": "Brown",
        "mainAbility": "Speed",
        "story": "Toadette, the spirited and energetic member of the Toad species, brings a vibrant energy to every adventure she embarks on. Known for her pink mushroom cap and braids, Toadette’s cheerful personality is infectious. She first appeared in Mario Kart: Double Dash!!, where her enthusiasm made her an instant fan favorite.Despite her small size, Toadette is fearless and resourceful. Her quick thinking and speed make her invaluable in high-stakes situations. Toadette’s ability to adapt to power-ups, such as transforming into Peachette with the Super Crown, demonstrates her versatility. She has proven herself not only as a capable adventurer but also as a strong competitor in races and sports.Toadette’s boundless optimism is her greatest strength. Even in challenging circumstances, she encourages her friends to keep moving forward. Her story is one of resilience and positivity, showing that even the smallest individuals can make a big impact.",
        "strengthLevel": "Low"
    },
    {
        "name": "Fawful",
        "description": "Antagonist",
        "image": "https://static.wikia.nocookie.net/hello-yoshi/images/e/eb/1168px-Fawful_artwork_MLBiS.png",
        "height": "120 cm",
        "weight": "35 kg",
        "eyeColor": "Red",
        "mainAbility": "Deception",
        "story": "Fawful, the eccentric and diabolical mastermind, is one of the most memorable antagonists in the Mushroom Kingdom. Known for his unique mannerisms and nonsensical phrases, such as “I HAVE FURY!”, Fawful brings a blend of chaos and comedy to every scheme. First appearing in Mario & Luigi: Superstar Saga, he quickly rose to prominence as a villain with grand ambitions and a penchant for theatricality.As Cackletta’s loyal minion, Fawful played a key role in their plot to conquer the Beanbean Kingdom. However, his journey didn’t end there. In Mario & Luigi: Bowser’s Inside Story, Fawful stepped into the spotlight, orchestrating an elaborate plan to take control of the Mushroom Kingdom. His intelligence and resourcefulness made him a formidable foe, capable of manipulating even Bowser.Despite his villainy, Fawful’s over-the-top personality and quirky behavior make him a fan favorite. His story is one of ambition and madness, showing the fine line between genius and chaos. For the Mushroom Kingdom, Fawful is a reminder that the most unconventional enemies often leave the most lasting impressions.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Toadsworth",
        "description": "Elderly Toad",
        "image": "https://static.wikia.nocookie.net/mario/images/0/0e/Toadsworth_SMS_artwork.png",
        "height": "90 cm",
        "weight": "25 kg",
        "eyeColor": "Brown",
        "mainAbility": "Wisdom",
        "story": "Toadsworth, the elder statesman of the Toad species, serves as Princess Peach’s trusted advisor. With his spectacles, cane, and dignified manner, Toadsworth exudes wisdom and authority. He has accompanied Peach on many of her adventures, offering guidance and ensuring her safety.Despite his age, Toadsworth is remarkably spry. His knowledge of the Mushroom Kingdom’s history and customs makes him an invaluable resource in diplomatic matters. Toadsworth’s cautious nature contrasts with the boldness of characters like Mario, creating a balance in their adventures.Toadsworth’s story is one of loyalty and experience. His steadfast dedication to Princess Peach and his role as a mentor to younger Toads highlight his importance. For the Mushroom Kingdom, Toadsworth is not just a caretaker; he is a living link to its traditions and values.",
        "strengthLevel": "Low"
    },
    {
        "name": "Monty Mole",
        "description": "",
        "image": "https://upload.wikimedia.org/wikipedia/en/b/b9/Toad_by_Shigehisa_Nakaue.png",
        "height": "50 cm",
        "weight": "15 kg",
        "eyeColor": "Black",
        "mainAbility": "Digging",
        "story": "Monty Mole, the mischievous tunneler of the Mushroom Kingdom, is a character who thrives underground. Known for his burrowing abilities and knack for causing chaos, Monty Mole often emerges at the most inconvenient times to disrupt Mario and his allies. Despite his role as an obstacle, Monty Mole’s antics bring a sense of humor to his appearances.Monty Mole’s resourcefulness is his greatest strength. His ability to dig through terrain and launch surprise attacks makes him a tricky opponent. However, he’s not without charm—his goofy demeanor and small stature make him a fan favorite among Mario’s rogues.Monty Mole’s story is one of persistence and cleverness. As a symbol of unpredictability, he reminds players that even the smallest challenges can be the most entertaining.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Donkey Kong",
        "description": "",
        "image": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d4/Donkey_Kong_character.png/220px-Donkey_Kong_character.png",
        "height": "200 cm",
        "weight": "150 kg",
        "eyeColor": "Brown",
        "mainAbility": "Strength",
        "story": "Donkey Kong, the muscle-bound protector of the jungle, is a character known for his immense strength and vibrant personality. First appearing as Mario’s rival in the original Donkey Kong, DK has evolved into a heroic figure and a protector of his tropical home. His loyalty to his friends and love for bananas drive many of his adventures.Donkey Kong’s strength is unparalleled. Whether battling Kremlings in Donkey Kong Country or competing in sporting events, he uses his powerful fists and agility to overcome any challenge. Despite his brute force, DK is gentle-hearted, often displaying a playful and humorous side. His bond with Diddy Kong, his trusted sidekick, highlights his caring and mentoring nature.Donkey Kong’s story is one of redemption and heroism. From his beginnings as an antagonist to becoming a beloved hero, DK showcases the journey of growth and responsibility. His adventures are a testament to the power of loyalty, courage, and embracing one’s role as a protector.",
        "strengthLevel": "Extreme"
    },
    {
        "name": "Ludwig von Koopa",
        "description": "Eldest leader of the Koopalings",
        "image": "https://static.wikia.nocookie.net/papermario/images/b/b3/PMCS_Ludwig-0.png",
        "height": "130 cm",
        "weight": "55 kg",
        "eyeColor": "Blue",
        "mainAbility": "Strategy",
        "story": "Ludwig von Koopa, the eldest and most cunning of the Koopalings, is a character of intellect and ambition. With his signature blue hair and mischievous grin, Ludwig exudes confidence and pride in his abilities. As the de facto leader of the Koopalings, he commands respect from his siblings and serves as one of Bowser’s most trusted lieutenants.Ludwig’s defining traits are his strategic mind and mastery of magic. His battles often involve elaborate schemes and powerful spells, making him one of the most challenging Koopalings to defeat. His creativity extends beyond combat—Ludwig is also portrayed as a musical genius, often using his talents to create chaos for Mario and his allies.Despite his villainous role, Ludwig’s charisma and leadership qualities make him a standout character. His interactions with his siblings reveal a competitive but caring dynamic, showing that his confidence is balanced by a sense of responsibility. Ludwig’s story is one of ambition and brilliance, showcasing a character who thrives on strategy and creativity.For the Mushroom Kingdom, Ludwig von Koopa is a reminder that intellect and ingenuity are powerful tools, even in the hands of a mischievous Koopaling.",
        "strengthLevel": "High"
    },
    {
        "name": "Major Burrows",
        "description": "",
        "image": "https://static.wikia.nocookie.net/fantendo/images/5/53/Major_Burrows.png",
        "height": "180 cm",
        "weight": "120 kg",
        "eyeColor": "Brown",
        "mainAbility": "Tunneling",
        "story": "Major Burrows, the fearsome and burly Monty Mole, is a boss character known for his dominance in the underground world. First appearing in Super Mario Galaxy, Major Burrows commands the subterranean with raw strength and a menacing presence. His large, rotund figure, coupled with his ferocity, makes him a daunting adversary for Mario and his friends.Major Burrows’ primary tactic is his ability to burrow at lightning speed, ambushing unsuspecting foes from below. His sharp claws and powerful leaps make him a formidable challenge, especially when enraged. Despite his aggression, Major Burrows’ actions often seem motivated by a sense of territoriality rather than pure malice, making him a more nuanced antagonist.In battle, Major Burrows is relentless, requiring Mario to outwit him by exploiting his patterns of attack. However, his gruff demeanor hides a certain comedic charm, especially when he’s caught off guard. His larger-than-life personality and physicality make him a memorable boss in Mario’s adventures.Major Burrows’ story is one of strength and determination. As a protector of his underground domain, he embodies the resilience of nature and the challenge of overcoming seemingly insurmountable obstacles.",
        "strengthLevel": "High"
    },
    {
        "name": "Luigi",
        "description": "The Protagonist",
        "image": "https://upload.wikimedia.org/wikipedia/en/b/be/Luigi_by_Shigehisa_Nakaue.png",
        "height": "160 cm",
        "weight": "70 kg",
        "eyeColor": "Green",
        "mainAbility": "Jumping",
        "story": "Luigi, Mario’s loyal and often underestimated brother, has carved out his own legacy in the Mushroom Kingdom. Known for his green cap and lanky frame, Luigi may lack Mario’s bravado, but he more than compensates with courage and resourcefulness. His journey began in Mario’s shadow, but over time, Luigi has proven himself as a hero in his own right.While Mario is fearless, Luigi’s cautious nature makes his victories all the more inspiring. Whether braving haunted mansions in Luigi’s Mansion or venturing into perilous worlds alongside Mario, Luigi consistently rises to the occasion. His powerful jumps and unique abilities, such as the Super Jump Punch, are vital in overcoming challenges.Beyond his heroics, Luigi’s personality is endearing. His awkward charm, coupled with a deep sense of loyalty to his brother and friends, makes him relatable. Despite his fears, Luigi is fiercely protective of those he cares about. His story is one of self-discovery and determination, showing that heroes come in all forms. For the Mushroom Kingdom, Luigi is a symbol of quiet strength and the power of stepping out of one’s comfort zone.",
        "strengthLevel": "High"
    },
    {
        "name": "Rosalina",
        "description": "Non-Player Character",
        "image": "https://static.wikia.nocookie.net/mario/images/5/56/Rosalina-MPTop100-Transparent.png",
        "height": "190 cm",
        "weight": "70 kg",
        "eyeColor": "Blue",
        "mainAbility": "Stellar Control",
        "story": "Rosalina, the enigmatic guardian of the cosmos, stands apart as one of the most majestic figures in the Mario universe. Her origins are shrouded in mystery, but her nurturing role as the protector of the Lumas has cemented her as a pivotal character. First introduced in Super Mario Galaxy, Rosalina oversees the Comet Observatory, a celestial vessel that journeys through the stars.Rosalina’s calm and composed demeanor hides a poignant backstory. Her deep bond with the Lumas stems from a personal loss, and her journey to care for them mirrors her own healing. Her immense knowledge of the universe and her ability to manipulate cosmic forces make her a powerful ally. Whether guiding Mario through the galaxy or confronting interstellar threats, Rosalina’s strength and wisdom shine.Despite her ethereal presence, Rosalina is deeply compassionate. She takes time to understand those around her, offering guidance and solace. Her connection to the Lumas is maternal, and she often refers to them as her family. Rosalina’s story is one of love, loss, and renewal, reminding everyone that even in the vastness of the universe, bonds of care and kindness endure.",
        "strengthLevel": "Extreme"
    },
    {
        "name": "Baby Rosalina",
        "description": "Detective",
        "image": "https://static.wikia.nocookie.net/mk-tour/images/3/33/MKT_Artwork_BabyRosalina.png",
        "height": "80 cm",
        "weight": "15 kg",
        "eyeColor": "Blue",
        "mainAbility": "Curiosity",
        "story": "Baby Rosalina, the youthful counterpart of the cosmic protector Rosalina, brings a sense of curiosity and wonder to the Mushroom Kingdom. Despite her small stature and youthful innocence, Baby Rosalina exhibits a surprising connection to the stars, hinting at her future role as the guardian of the cosmos.Appearing primarily in racing games like Mario Kart 8, Baby Rosalina shows an adventurous side, eager to compete with the older and more experienced characters. Her calm demeanor mirrors her adult self, but her playful energy and curiosity give her a unique charm. She is often seen exploring new worlds and interacting with Lumas, suggesting an early bond with the galaxy’s mysteriesBaby Rosalina’s story is one of discovery and potential. She represents the beginnings of a journey that will one day make her a vital figure in the Mushroom Kingdom’s universe. Her adventures remind everyone that even the smallest beginnings can lead to great destinies.",
        "strengthLevel": "Low"
    },
    {
        "name": "Wario",
        "description": "Boss Character",
        "image": "https://upload.wikimedia.org/wikipedia/en/8/81/Wario.png",
        "height": "150 cm",
        "weight": "100 kg",
        "eyeColor": "Black",
        "mainAbility": "Power",
        "story": "Wario, the loud and greedy counterpart to Mario, is a character full of contradictions. With his bulky build, iconic yellow attire, and mischievous grin, Wario is a force of chaos in the Mushroom Kingdom. While his primary motivation is often self-serving—usually involving treasure or food—Wario occasionally surprises everyone with moments of unexpected heroism.Wario’s strength and resilience make him a formidable competitor. Whether breaking blocks with his brute force or outmaneuvering his rivals in races and battles, he thrives on power and unpredictability. His penchant for treasure hunting has led him on adventures in games like Wario Land and WarioWare, where his cunning and creativity take center stage.Despite his brash personality, Wario’s antics often have a humorous edge, making him a beloved character even as he causes trouble. His story is one of ambition and audacity, showing that even the most unconventional figures can carve out a unique legacy.",
        "strengthLevel": "High"
    },
    {
        "name": "Bowser",
        "description": "Fictional Character",
        "image": "https://upload.wikimedia.org/wikipedia/en/d/d1/Bowser_by_Shigehisa_Nakaue.png",
        "height": "250 cm",
        "weight": "1000 kg",
        "eyeColor": "Red",
        "mainAbility": "Fire-breathing",
        "story": "As the king of the Koopas, Bowser is a relentless force of destruction. Known for his fiery breath and immense power, he remains Mario's most enduring nemesis.",
        "strengthLevel": "Extreme"
    },
    {
        "name": "Toad",
        "description": "Princess Peach's Handler",
        "image": "https://upload.wikimedia.org/wikipedia/en/b/b9/Toad_by_Shigehisa_Nakaue.png",
        "height": "90 cm",
        "weight": "20 kg",
        "eyeColor": "Brown",
        "mainAbility": "Loyalty",
        "story": "Toad, one of the Mushroom Kingdom’s most loyal citizens, serves as Princess Peach’s right-hand helper and a constant ally to Mario. With his mushroom-shaped head and cheerful disposition, Toad embodies the spirit of unwavering dedication and bravery, despite his small stature.Toad’s role often involves supporting the heroes in their quests, whether by providing critical information, guarding Peach’s castle, or delivering supplies. However, he’s no stranger to action. In games like Super Mario Bros. 2, Toad takes on a more active role, showcasing his speed and strength. His bravery shines when he stands up to foes much larger than himself, proving that courage isn’t measured by size.Toad’s story is one of steadfast loyalty and perseverance. His willingness to step up, even in the face of danger, makes him an essential part of the Mushroom Kingdom’s adventures. For Peach and her kingdom, Toad is more than a servant—he’s a trusted friend and a hero in his own right.",
        "strengthLevel": "Low"
    },
    {
        "name": "Princess Daisy",
        "description": "Ruler of Sarasaland",
        "image": "https://upload.wikimedia.org/wikipedia/en/e/eb/Princess_Daisy_by_Shigehisa_Nakaue.png",
        "height": "160 cm",
        "weight": "55 kg",
        "eyeColor": "Green",
        "mainAbility": "Charisma",
        "story": "Princess Daisy, the spirited ruler of Sarasaland, is known for her bold personality and adventurous spirit. Unlike her counterpart, Princess Peach, Daisy exudes a fiery energy that sets her apart. With her bright orange dress and infectious enthusiasm, Daisy is a force to be reckoned with in both diplomacy and competition.Daisy’s journey began in Super Mario Land, where she was rescued by Mario from the clutches of Tatanga. Since then, she has become a prominent figure in sports games, kart racing, and other events, where her competitive nature shines. Her athleticism and determination make her a formidable opponent, whether on the track or the court.Beyond her competitive streak, Daisy is a compassionate leader who deeply cares for her people. Her lively demeanor and ability to connect with others make her a beloved figure in Sarasaland and beyond. Daisy’s story is one of strength, charisma, and independence, proving that a ruler can be both fierce and fun.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Waluigi",
        "description": "Mischief",
        "image": "https://upload.wikimedia.org/wikipedia/en/c/c1/Waluigi_by_Shigehisa_Nakaue.png",
        "height": "180 cm",
        "weight": "65 kg",
        "eyeColor": "Purple",
        "mainAbility": "Trickery",
        "story": "Waluigi, the lanky and mischievous counterpart to Luigi, is one of the Mushroom Kingdom's most enigmatic characters. Known for his purple attire, wiry build, and signature mustache, Waluigi thrives on chaos and trickery. Often seen teaming up with Wario, his equally devious partner, Waluigi brings a unique flair to every competition and adventure.Despite often being cast as a troublemaker, Waluigi's motivations are more complex. He enjoys competing, whether on the tennis court, the kart track, or in other sporting events. His sly tactics and unpredictable nature make him a formidable opponent. However, beneath his scheming exterior lies a character who craves recognition and a sense of belonging. Waluigi’s antics are not purely selfish but driven by a desire to prove himself.Waluigi’s exaggerated personality, from his over-the-top laughter to his dramatic gestures, makes him both a comedic figure and a wildcard. His story is one of mischief, ambition, and resilience, showcasing that even the most chaotic characters can leave a lasting impression.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Yoshi",
        "description": "Fictional Dinosaur",
        "image": "https://upload.wikimedia.org/wikipedia/pt/4/48/Yoshi.png",
        "height": "170 cm",
        "weight": "60 kg",
        "eyeColor": "Black",
        "mainAbility": "Eating",
        "story": "Yoshi, the loyal and lovable dinosaur, has been a steadfast companion to Mario since his debut in Super Mario World. Known for his cheerful demeanor and unique abilities, Yoshi is more than just a sidekick; he is a hero in his own right. His long tongue, flutter jump, and ability to turn enemies into helpful eggs make him an indispensable ally.Yoshi’s adventures extend beyond assisting Mario. In Yoshi’s Island, he protects Baby Mario and proves his bravery and independence. Despite his gentle nature, Yoshi is no stranger to battle, using his skills to overcome challenges and protect his friends. Whether racing karts, playing sports, or embarking on solo adventures, Yoshi’s resourcefulness always shines.What makes Yoshi truly special is his unwavering loyalty. He forms deep bonds with those around him, offering comfort and support in the most challenging times. Yoshi’s story is one of kindness, perseverance, and the joy of friendship, making him a beloved figure in the Mushroom Kingdom.",
        "strengthLevel": "High"
    },
    {
        "name": "Bowser Jr.",
        "description": "Child Son of Bowser",
        "image": "https://static.wikia.nocookie.net/mario/images/5/5d/Bowser_Jr_SMB_Wonder_artwork.png",
        "height": "120 cm",
        "weight": "40 kg",
        "eyeColor": "Red",
        "mainAbility": "Mischief",
        "story": "Bowser Jr., the mischievous and ambitious son of Bowser, is a character full of youthful exuberance and determination. With his trusty paintbrush and Clown Car, Bowser Jr. eagerly follows in his father’s footsteps, often leading his own schemes to thwart Mario. Despite his age, Bowser Jr. is a formidable foe, combining his creativity with his natural Koopa strength.Bowser Jr.’s loyalty to his father is unwavering. He often takes on the role of Bowser’s right-hand minion, helping execute plans to conquer the Mushroom Kingdom. However, his actions are motivated not by malice but by a desire to earn his father’s approval. This dynamic adds depth to his character, making him more than just a mischievous troublemaker.While Bowser Jr. enjoys causing chaos, he has also shown moments of camaraderie and humor. His playful nature and youthful curiosity often lead to unintended antics, making him a surprisingly endearing figure. Bowser Jr.’s story is one of ambition, family, and the challenges of growing up under a powerful legacy.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Lakitu",
        "description": "Minor Character",
        "image": "https://i.pinimg.com/564x/93/5b/7f/935b7f1a57d78b4c68bd0a7598dfa442.jpg",
        "height": "100 cm",
        "weight": "30 kg",
        "eyeColor": "Brown",
        "mainAbility": "Cloud Riding",
        "story": "Lakitu, the cloud-riding Koopa, has played many roles in the Mushroom Kingdom’s adventures. Known for his signature cloud and fishing rod, Lakitu is both a helper and a hindrance. As an adversary, he drops Spinies from above, creating obstacles for Mario and his friends. However, as a helper, he serves as the referee in races and other competitions.Lakitu’s versatility makes him a fascinating character. His ability to adapt to different roles, whether enforcing rules or creating chaos, highlights his resourcefulness. Despite his mischievous tendencies, Lakitu is not inherently malicious. His actions often seem motivated by a love of fun and challenge rather than malice.Lakitu’s story is one of duality. He embodies both conflict and cooperation, showing that even the most unpredictable characters have layers. Whether aiding or opposing Mario, Lakitu’s presence always adds an element of surprise to the Mushroom Kingdom.",
        "strengthLevel": "Low"
    },
    {
        "name": "Metal Mario",
        "description": "Transformed Mario",
        "image": "https://static.wikia.nocookie.net/mario/images/7/7e/Metal_Mario_Artwork_2_-_Mario_Kart_7.png",
        "height": "155 cm",
        "weight": "120 kg",
        "eyeColor": "Silver",
        "mainAbility": "Invincibility",
        "story": "Metal Mario, the transformed and invincible version of the Mushroom Kingdom’s hero, is a force of raw power and resilience. First introduced in Super Mario 64, Metal Mario’s metallic sheen and unyielding strength make him a unique and formidable character. With his heavy frame and resistance to damage, Metal Mario is the epitome of an unstoppable force.Unlike his counterpart, Metal Mario operates with calculated precision, often walking through obstacles that would challenge regular Mario. His transformation, activated by the Metal Cap, is both a tactical advantage and a symbol of Mario’s adaptability. Whether racing on the track or battling in arenas, Metal Mario’s stoic determination and sheer might are unmatched.Metal Mario’s story is one of evolution, showcasing the limitless potential of Mario’s abilities when pushed to their extremes. As a transformed hero, he embodies strength and perseverance, proving that sometimes, the toughest battles require a tougher form.",
        "strengthLevel": "Extreme"
    },
    {
        "name": "Diddy Kong",
        "description": "",
        "image": "https://static.wikia.nocookie.net/mario/images/6/64/MK8D_BCP_Diddy_Kong_Artwork.png",
        "height": "150 cm",
        "weight": "45 kg",
        "eyeColor": "Brown",
        "mainAbility": "Agility",
        "story": "Diddy Kong, Donkey Kong’s energetic sidekick, is a character brimming with enthusiasm and agility. Known for his red cap and rocket-powered jetpack, Diddy Kong is a fearless adventurer who often accompanies Donkey Kong on daring missions to protect their jungle home.Diddy Kong’s quick reflexes and inventive gadgets make him a valuable partner. Whether navigating treacherous terrain or battling enemies, Diddy Kong’s ingenuity is unmatched. His playful nature and infectious energy bring levity to even the most serious situations.Beyond his role as a sidekick, Diddy Kong has proven himself as a leader, starring in his own adventures. His story is one of teamwork, courage, and the bond between friends. For the jungle and beyond, Diddy Kong represents the spirit of adventure and the power of collaboration.",
        "strengthLevel": "Medium"
    },
    {
        "name": "King Bob-omb",
        "description": "",
        "image": "https://static.wikia.nocookie.net/mario/images/e/e2/MPSR_King_Bob_omb.png",
        "height": "200 cm",
        "weight": "500 kg",
        "eyeColor": "Black",
        "mainAbility": "Explosives",
        "story": "King Bob-omb, the explosive ruler of the Bob-ombs, is a character of immense power and authority. Sitting atop his mountain fortress, King Bob-omb commands his minions with a mix of strategic brilliance and overwhelming might. First appearing in Super Mario 64, he challenges Mario to a test of strength, serving as an early but memorable adversary.Despite his imposing appearance, King Bob-omb is not without a sense of honor. His challenges are often framed as tests, offering a fair fight to those brave enough to face him. His explosive temper and sheer size make him a formidable foe, but his respect for strength and bravery adds depth to his character.King Bob-omb’s story is one of leadership and power. As a ruler, he embodies the balance between strength and fairness, reminding his opponents that even the fiercest adversaries can command respect through their actions.",
        "strengthLevel": "High"
    },
    {
        "name": "Honey Queen",
        "description": "Boss of Fourth World",
        "image": "https://oyster.ignimgs.com/mediawiki/apis.ign.com/mario-kart-7/9/94/Character-honey-queen.png",
        "height": "220 cm",
        "weight": "300 kg",
        "eyeColor": "Yellow",
        "mainAbility": "Royal Command",
        "story": "Honey Queen, the regal monarch of the Honeybee Galaxy, is a figure of grace and authority in the Mario universe. Her massive size and distinctive buzzing voice make her an unforgettable character. Honey Queen’s role in Super Mario Galaxy introduced players to her tranquil yet commanding presence as she oversees her kingdom’s lush, honey-filled lands.Despite her grandeur, Honey Queen is approachable and kind-hearted. She warmly welcomes Mario during his adventures and often provides guidance and rewards for his assistance. Her relationship with the Lumas and her dedication to maintaining the harmony of her galaxy showcase her nurturing side. As a ruler, Honey Queen balances regal poise with genuine warmth, earning the respect and admiration of her subjects.Honey Queen’s story is one of stewardship and responsibility. Her efforts to protect her domain from cosmic threats, while maintaining an air of serenity, embody the strength and elegance of a true monarch. For the Honeybee Galaxy, she is both a leader and a guardian, ensuring that her world remains a haven of peace and beauty.",
        "strengthLevel": "Medium"
    },
    {
        "name": "E.Gadd",
        "description": "Gadget-inventing scientist",
        "image": "https://static.wikia.nocookie.net/pm-universe/images/f/fa/Professor_Elvin_Gadd_Artwork_-_Luigi%27s_Mansion_Dark_Moon.png",
        "height": "100 cm",
        "weight": "25 kg",
        "eyeColor": "Blue",
        "mainAbility": "Invention",
        "story": "Professor Elvin Gadd, affectionately known as E. Gadd, is the Mushroom Kingdom’s eccentric inventor and scientific genius. With his thick glasses, quirky smile, and boundless enthusiasm for experimentation, E. Gadd is the mastermind behind many of the gadgets and technologies that aid Mario and Luigi in their adventures.E. Gadd’s first major appearance was in Luigi’s Mansion, where he provided Luigi with the Poltergust 3000, a ghost-catching vacuum cleaner. His innovative creations, such as the FLUDD in Super Mario Sunshine and the time-traveling devices in Mario & Luigi: Partners in Time, have proven essential in overcoming countless challenges. Despite his scatterbrained demeanor, E. Gadd’s intellect and ingenuity are unparalleled.Beyond his role as an inventor, E. Gadd has a peculiar charm. His playful yet methodical approach to science reflects a genuine love for discovery. Whether developing ghost-detecting devices or experimenting with strange substances, E. Gadd’s curiosity knows no bounds. His story is one of creativity and innovation, showing that even the quirkiest minds can change the world.",
        "strengthLevel": "Medium"
    },
    {
        "name": "Poochy",
        "description": "",
        "image": "https://static.wikia.nocookie.net/mariokart/images/3/3e/Poochy.png",
        "height": "50 cm",
        "weight": "10 kg",
        "eyeColor": "Brown",
        "mainAbility": "Loyalty",
        "story": "Poochy, the loyal and energetic pup, is a steadfast companion to Yoshi and the gang. With his wagging tail and cheerful bark, Poochy is always ready to lend a paw in the Mushroom Kingdom’s adventures. His unassuming appearance hides a remarkable ability to traverse difficult terrain, making him an invaluable ally.Poochy’s defining trait is his unwavering loyalty. Whether helping Yoshi carry heavy loads or guiding him across treacherous landscapes, Poochy’s dedication never wavers. His playful nature and boundless energy make him a source of comfort and joy, even in the most challenging situations.Poochy’s story is one of companionship and resilience. He reminds everyone that loyalty and determination can make even the smallest creatures heroes. For Yoshi and the others, Poochy is more than a pet—he’s a true friend.",
        "strengthLevel": "Low"
    },
    {
        "name": "King Boo",
        "description": "Memorable Character",
        "image": "https://static.wikia.nocookie.net/mk-tour/images/a/a9/King_Boo_Artwork_MSS.png",
        "height": "150 cm",
        "weight": "50 kg",
        "eyeColor": "Glowing Red",
        "mainAbility": "Haunting",
        "story": "As the leader of the ghostly Boos, King Boo is a spectral figure of immense power and cunning. His glowing red eyes and menacing grin make him one of the Mushroom Kingdom’s most fearsome foes. First appearing in Luigi’s Mansion, King Boo orchestrates elaborate hauntings to trap Luigi and his friends, showcasing his strategic mind and supernatural abilities.King Boo’s powers go beyond haunting. He can manipulate objects, summon ghostly minions, and create illusions to confuse his enemies. Despite his menacing persona, King Boo has a mischievous side, often toying with his opponents for his own amusement. His rivalry with Luigi, in particular, has led to some of the most memorable battles in the Mushroom Kingdom’s history.While King Boo is undeniably a villain, his loyalty to his ghostly kingdom reveals a sense of responsibility and leadership. His story is one of mystery and mischief, blending terror and humor in a way that only a spectral ruler could.",
        "strengthLevel": "High"
    },
    {
        "name": "Ninji",
        "description": "",
        "image": "https://play.nintendo.com/images/PLAY-6579-Ninji-FriendPage-Circle_v01.7bf2a8f2.aead314d58b63e27.jpg",
        "height": "80 cm",
        "weight": "20 kg",
        "eyeColor": "Black",
        "mainAbility": "Speed",
        "story": "Ninji, the stealthy and swift creature, is one of the Mushroom Kingdom's most enigmatic figures. Recognizable by his ninja-like appearance and sharp precision, Ninji is known for his incredible speed and agility. First appearing as an enemy in Super Mario Bros. 2, Ninji’s role has evolved over time, showcasing his adaptability and versatility.As an adversary, Ninji poses a unique challenge. His ability to leap across platforms with precision and speed makes him a tricky foe to outmaneuver. However, his skills are not limited to combat. In more recent games, such as Super Mario Maker 2, Ninji has appeared in timed challenges, demonstrating his competitive nature and providing players with an exciting test of their abilities.Beyond his role as an obstacle, Ninji embodies the spirit of discipline and focus. His story is one of silent dedication, showcasing that even the smallest and most unassuming characters can have a profound impact. Whether as a rival or an ally, Ninji’s presence adds an element of excitement to any adventure.",
        "strengthLevel": "Medium"
    }
]
